In [1]:
import numpy as np
import pandas as pd

In [2]:
data = pd.read_csv('data.csv')
data.head()

,area_type,availability,size,society,total_sqft,bath,balcony,price,site_location
0,Super built-up Area,19-Dec,2 BHK,Coomee,1056,2.0,1.0,39.07,Alandi Road
1,Plot Area,Ready To Move,4 Bedroom,Theanmp,2600,5.0,3.0,120.00,Ambegaon Budruk
2,Built-up Area,Ready To Move,3 BHK,NaN,1440,2.0,3.0,62.00,Anandnagar
3,Super built-up Area,Ready To Move,3 BHK,Soiewre,1521,3.0,1.0,95.00,Aundh
4,Super built-up Area,Ready To Move,2 BHK,NaN,1200,2.0,1.0,51.00,Aundh Road

In [3]:
data.shape

(13320, 9)

In [4]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13320 entries, 0 to 13319
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   area_type      13320 non-null  object
 1   availability   13320 non-null  object
 2   size           13304 non-null  object
 3   society        7818 non-null   object
 4   total_sqft     13320 non-null  object
 5   bath           13247 non-null  float64
 6   balcony        12711 non-null  float64
 7   price          13320 non-null  float64
 8   site_location  13319 non-null  object
dtypes: float64(3), object(6)
memory usage: 936.7+ KB

In [5]:
for column in data.columns:
    print(data[column].value_counts())
    print("*"*20)

Super built-up  Area    8790
Built-up  Area          2418
Plot  Area              2025
Carpet  Area              87
Name: area_type, dtype: int64
********************
Ready To Move    10581
18-Dec             307
18-May             295
18-Apr             271
18-Aug             200
                 ...
15-Aug               1
17-Jan               1
16-Nov               1
16-Jan               1
14-Jul               1
Name: availability, Length: 81, dtype: int64
********************
2 BHK         5199
3 BHK         4310
4 Bedroom      826
4 BHK          591
3 Bedroom      547
1 BHK          538
2 Bedroom      329
5 Bedroom      297
6 Bedroom      191
1 Bedroom      105
8 Bedroom       84
7 Bedroom       83
5 BHK           59
9 Bedroom       46
6 BHK           30
7 BHK           17
1 RK            13
10 Bedroom      12
9 BHK            8
8 BHK            5
11 BHK           2
11 Bedroom       2
10 BHK           2
14 BHK           1
13 BHK           1
12 Bedroom       1
27 BHK           1
43 Bedroom       1
16 BHK           1
19 BHK           1
18 Bedroom       1
Name: size, dtype: int64
********************
GrrvaGr    80
PrarePa    76
Sryalan    59
Prtates    59
GMown E    56
           ..
Amionce     1
JaghtDe     1
Jauraht     1
Brity U     1
RSntsAp     1
Name: society, Length: 2688, dtype: int64
********************
1200    843
1100    221
1500    205
2400    196
600     180
       ...
3580      1
2461      1
1437      1
2155      1
4689      1
Name: total_sqft, Length: 2117, dtype: int64
********************
2.0     6908
3.0     3286
4.0     1226
1.0      788
5.0      524
6.0      273
7.0      102
8.0       64
9.0       43
10.0      13
12.0       7
13.0       3
11.0       3
16.0       2
27.0       1
40.0       1
15.0       1
14.0       1
18.0       1
Name: bath, dtype: int64
********************
2.0    5113
1.0    4897
3.0    1672
0.0    1029
Name: balcony, dtype: int64
********************
75.00     310
65.00     302
55.00     275
60.00     270
45.00     240
         ...
351.00      1
54.10       1
80.64       1
32.73       1
488.00      1
Name: price, Length: 1994, dtype: int64
********************
Alandi Road            139
Kalyani Nagar          139
Mahatma Gandhi Road    139
Lulla Nagar            139
Laxmi Road             139
                      ...
Sadashiv Peth          138
Raviwar Peth           138
Rasta Peth             138
Ghorpadi               138
other                    1
Name: site_location, Length: 97, dtype: int64
********************

In [6]:
data.isna().sum()

area_type           0
availability        0
size               16
society          5502
total_sqft          0
bath               73
balcony           609
price               0
site_location       1
dtype: int64

In [7]:
data.drop(columns= ["society","area_type","availability","balcony"],inplace=True)

In [8]:
data.head()

        size total_sqft  bath   price    site_location
0      2 BHK       1056   2.0   39.07      Alandi Road
1  4 Bedroom       2600   5.0  120.00  Ambegaon Budruk
2      3 BHK       1440   2.0   62.00       Anandnagar
3      3 BHK       1521   3.0   95.00            Aundh
4      2 BHK       1200   2.0   51.00       Aundh Road

In [9]:
data.describe()

               bath         price
count  13247.000000  13320.000000
mean       2.692610    112.565627
std        1.341458    148.971674
min        1.000000      8.000000
25%        2.000000     50.000000
50%        2.000000     72.000000
75%        3.000000    120.000000
max       40.000000   3600.000000

In [10]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13320 entries, 0 to 13319
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   size           13304 non-null  object
 1   total_sqft     13320 non-null  object
 2   bath           13247 non-null  float64
 3   price          13320 non-null  float64
 4   site_location  13319 non-null  object
dtypes: float64(2), object(3)
memory usage: 520.4+ KB

In [11]:
data["site_location"].value_counts()

Alandi Road            139
Kalyani Nagar          139
Mahatma Gandhi Road    139
Lulla Nagar            139
Laxmi Road             139
                      ...
Sadashiv Peth          138
Raviwar Peth           138
Rasta Peth             138
Ghorpadi               138
other                    1
Name: site_location, Length: 97, dtype: int64

In [12]:
data["site_location"] = data["site_location"].fillna('Mukund Nagar')

In [13]:
data["size"].value_counts()

2 BHK         5199
3 BHK         4310
4 Bedroom      826
4 BHK          591
3 Bedroom      547
1 BHK          538
2 Bedroom      329
5 Bedroom      297
6 Bedroom      191
1 Bedroom      105
8 Bedroom       84
7 Bedroom       83
5 BHK           59
9 Bedroom       46
6 BHK           30
7 BHK           17
1 RK            13
10 Bedroom      12
9 BHK            8
8 BHK            5
11 BHK           2
11 Bedroom       2
10 BHK           2
14 BHK           1
13 BHK           1
12 Bedroom       1
27 BHK           1
43 Bedroom       1
16 BHK           1
19 BHK           1
18 Bedroom       1
Name: size, dtype: int64

In [14]:
data["size"] = data["size"].fillna('2 BHK')

In [15]:
data["bath"].median()

2.0

In [16]:
data["bath"] = data["bath"].fillna(data["bath"].median())

In [17]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13320 entries, 0 to 13319
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   size           13320 non-null  object
 1   total_sqft     13320 non-null  object
 2   bath           13320 non-null  float64
 3   price          13320 non-null  float64
 4   site_location  13320 non-null  object
dtypes: float64(2), object(3)
memory usage: 520.4+ KB

In [18]:
data["bhk"] = data["size"].str.split().str.get(0).astype(int)

In [19]:
data.head()

        size total_sqft  bath   price    site_location  bhk
0      2 BHK       1056   2.0   39.07      Alandi Road    2
1  4 Bedroom       2600   5.0  120.00  Ambegaon Budruk    4
2      3 BHK       1440   2.0   62.00       Anandnagar    3
3      3 BHK       1521   3.0   95.00            Aundh    3
4      2 BHK       1200   2.0   51.00       Aundh Road    2

In [20]:
data.rename(columns={'site_location':'location'},inplace=True)

In [21]:
data.head()

        size total_sqft  bath   price         location  bhk
0      2 BHK       1056   2.0   39.07      Alandi Road    2
1  4 Bedroom       2600   5.0  120.00  Ambegaon Budruk    4
2      3 BHK       1440   2.0   62.00       Anandnagar    3
3      3 BHK       1521   3.0   95.00            Aundh    3
4      2 BHK       1200   2.0   51.00       Aundh Road    2

In [22]:
data[data["bhk"]>20]

            size total_sqft  bath  price       location  bhk
1718      27 BHK       8000  27.0  230.0  Uruli Devachi   27
4684  43 Bedroom       2400  40.0  660.0  Salunke Vihar   43

In [23]:
data["total_sqft"].unique()

array(['1056', '2600', '1440', ..., '1133 - 1384', '774', '4689'],
      dtype=object)

In [24]:
# checking float values
def is_float(x):
  try:
    float(x)
  except:
    return False
  return True

In [25]:
data[~data['total_sqft'].apply(is_float)]

            size   total_sqft  bath    price        location  bhk
30         4 BHK  2100 - 2850   4.0  186.000        Gultekdi    4
56     4 Bedroom  3010 - 3410   2.0  192.000    Model colony    4
81     4 Bedroom  2957 - 3450   2.0  224.500  Shukrawar Peth    4
122        4 BHK  3067 - 8156   4.0  477.000     Ganeshkhind    4
137        2 BHK  1042 - 1105   2.0   54.005         Khadaki    2
...          ...          ...   ...      ...             ...  ...
12990      3 BHK  1804 - 2273   3.0  122.000   Gokhale Nagar    3
13059      2 BHK  1200 - 1470   2.0   72.760      Anandnagar    2
13240      1 BHK  1020 - 1130   2.0   52.570  Vadgaon Budruk    1
13265      2 BHK  1133 - 1384   2.0   59.135          Dapodi    2
13299      4 BHK  2830 - 2882   5.0  154.500      Laxmi Road    4

[247 rows x 6 columns]

In [26]:


def convertRange(y):
  x = str(y)
  tokens = x.split('-')
  if len(tokens) == 2:
    return (float(tokens[0])+float(tokens[1])) / 2
  try:
    return float(x)
  except:
    return None

In [27]:
data["total_sqft"] = data["total_sqft"].apply(convertRange)

In [28]:
def seprateQuantity(x):
    temp = [char for char in x]
    print(temp)
    area = []
    acceptedValues = ['1', '2', '3', '4','5', '6', '7', '8','9', '0', '.']
    for value in temp:
        if value in acceptedValues:
            area.append(value)

    if(str(area[-1]) == '.'):
        area = area[0:-1]
        
    final_area = "".join(area)
    return float(final_area)
    
# seprateQuantity('123.4hello.')

In [29]:
data

            size  total_sqft  bath   price              location  bhk
0          2 BHK      1056.0   2.0   39.07           Alandi Road    2
1      4 Bedroom      2600.0   5.0  120.00       Ambegaon Budruk    4
2          3 BHK      1440.0   2.0   62.00            Anandnagar    3
3          3 BHK      1521.0   3.0   95.00                 Aundh    3
4          2 BHK      1200.0   2.0   51.00            Aundh Road    2
...          ...         ...   ...     ...                   ...  ...
13315  5 Bedroom      3453.0   4.0  231.00                Pashan    5
13316      4 BHK      3600.0   5.0  400.00             Paud Road    4
13317      2 BHK      1141.0   2.0   60.00              Pirangut    2
13318      4 BHK      4689.0   4.0  488.00          Prabhat Road    4
13319      1 BHK       550.0   1.0   17.00  Pune Railway Station    1

[13320 rows x 6 columns]

In [31]:
# Define a function to separate quantity and unit
def separate_quantity(x):
    try:
        # If the value is a string, extract the numeric part
        if isinstance(x, str):
            numeric_value = float(''.join(char for char in x if char.isdigit() or char == '.'))
            return numeric_value
        else:
            # If the value is not a string, return it as is
            return x
    except ValueError:
        # Handle the case where conversion to float fails
        return None

# Removing alphabets from the sqft column
# Applying this on 'a', 'r', and 's'
temp_df = data[data["total_sqft"].apply(lambda x: 's' in str(x))]

# Applying the function and storing in another column named 'tt'
temp_df['tt'] = temp_df["total_sqft"].apply(separate_quantity)

# Storing all the values back in the main dataframe
for i in temp_df.index:
    data.loc[i, 'total_sqft'] = temp_df.loc[i, 'tt']

In [32]:
data[data["total_sqft"].str.contains('S') ==True]

AttributeError: Can only use .str accessor with string values!

In [33]:
data["total_sqft"] = data["total_sqft"].apply(convertRange)

In [34]:
data.describe() # some values are less than 200

         total_sqft          bath         price           bhk
count  13274.000000  13320.000000  13320.000000  13320.000000
mean    1559.626694      2.688814    112.565627      2.802778
std     1238.405258      1.338754    148.971674      1.294496
min        1.000000      1.000000      8.000000      1.000000
25%     1100.000000      2.000000     50.000000      2.000000
50%     1276.000000      2.000000     72.000000      3.000000
75%     1680.000000      3.000000    120.000000      3.000000
max    52272.000000     40.000000   3600.000000     43.000000

In [35]:
data[data["total_sqft"] <100]

            size  total_sqft  bath  price         location  bhk
349    3 Bedroom        11.0   3.0   74.0     Narayan Peth    3
1020       1 BHK        15.0   1.0   30.0        Nana Peth    1
1122   5 Bedroom        24.0   2.0  150.0           Pashan    5
4086   4 Bedroom         1.0   4.0  120.0   Mangalwar peth    4
4972       7 BHK         5.0   7.0  115.0    Salunke Vihar    7
5970   1 Bedroom        45.0   1.0   23.0  Deccan Gymkhana    1
11558  4 Bedroom        60.0   4.0  218.0      Karve Nagar    4

In [36]:
# calculating price per square feet 

data['price_per_sq_ft'] = (data['price']/data['total_sqft'])*100000

In [37]:
data.describe()

         total_sqft          bath         price           bhk  price_per_sq_ft
count  13274.000000  13320.000000  13320.000000  13320.000000     1.327400e+04
mean    1559.626694      2.688814    112.565627      2.802778     7.907501e+03
std     1238.405258      1.338754    148.971674      1.294496     1.064296e+05
min        1.000000      1.000000      8.000000      1.000000     2.678298e+02
25%     1100.000000      2.000000     50.000000      2.000000     4.266865e+03
50%     1276.000000      2.000000     72.000000      3.000000     5.434306e+03
75%     1680.000000      3.000000    120.000000      3.000000     7.311746e+03
max    52272.000000     40.000000   3600.000000     43.000000     1.200000e+07

In [38]:
location_value_counts = data['location'].value_counts()

In [39]:
location_value_counts[location_value_counts<20]

other    1
Name: location, dtype: int64

In [40]:
data['location'] = data['location'].apply(lambda x : x.strip())

In [41]:
data['location'].value_counts()

Mukund Nagar      140
Alandi Road       139
Mangalwar peth    139
Lulla Nagar       139
Laxmi Road        139
                 ...
Sadashiv Peth     138
Raviwar Peth      138
Rasta Peth        138
Ghorpadi          138
other               1
Name: location, Length: 97, dtype: int64

In [42]:
(data['total_sqft']/data['bhk']).describe()

count    13274.000000
mean       575.074878
std        388.205175
min          0.250000
25%        473.333333
50%        552.500000
75%        625.000000
max      26136.000000
dtype: float64

In [43]:
data = data[(data['total_sqft']/data['bhk']) >300]

In [44]:
def remove_outlier_sqft(df):
    df_output = pd.DataFrame()
    for key , subdf in df.groupby('location'):
        
        m = np.mean(subdf.price_per_sq_ft) #mean
        
        st =  np.std(subdf.price_per_sq_ft) #std. deviation
        
        gen_df =  subdf[(subdf.price_per_sq_ft > (m-st)) & (subdf.price_per_sq_ft <= (m+st))]
        
        df_output = pd.concat([df_output,gen_df],ignore_index=True)
        
    return df_output

data = remove_outlier_sqft(data)
data.describe()

         total_sqft          bath         price           bhk  price_per_sq_ft
count  10759.000000  10759.000000  10759.000000  10759.000000     10759.000000
mean    1490.950922      2.448648     83.329911      2.555814      5351.071095
std      854.661800      0.954114     65.346185      0.887742      1558.525589
min      340.000000      1.000000     10.000000      1.000000      1379.310345
25%     1104.000000      2.000000     48.000000      2.000000      4186.952288
50%     1280.000000      2.000000     65.000000      2.000000      5096.262741
75%     1627.930000      3.000000     95.000000      3.000000      6292.804746
max    30400.000000     16.000000   2100.000000     16.000000     17548.524329

In [45]:
def bhk_outlier(df):
    exclude_indices = np.array([])
    for location, location_df in df.groupby('location'):
        bhk_stats = {}
        for bhk, bhk_df  in location_df.groupby('bhk'):
            bhk_stats[bhk] = {
                'mean' : np.mean(bhk_df.price_per_sq_ft),
                'std' : np.std(bhk_df.price_per_sq_ft),
                'count' : bhk_df.shape[0]
            }
            
        for bhk, bhk_df  in location_df.groupby('bhk'):
            stats = bhk_stats.get(bhk-1)
            if stats and stats['count']>5:
                exclude_indices = np.append(exclude_indices, bhk_df[bhk_df.price_per_sq_ft <(stats['mean'])].index.values)
    return df.drop(exclude_indices, axis = 'index')

In [46]:
data =  bhk_outlier(data)

In [47]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 7354 entries, 0 to 10758
Data columns (total 7 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   size             7354 non-null   object
 1   total_sqft       7354 non-null   float64
 2   bath             7354 non-null   float64
 3   price            7354 non-null   float64
 4   location         7354 non-null   object
 5   bhk              7354 non-null   int32
 6   price_per_sq_ft  7354 non-null   float64
dtypes: float64(4), int32(1), object(2)
memory usage: 430.9+ KB

In [48]:
data.drop(columns=['size','price_per_sq_ft'], inplace=True)

The data cleaning is done now,  saving cleand data

In [49]:
data.to_csv('cleaned_data.csv')

In [50]:

X = data.drop(columns=['price'])
y = data['price']

In [60]:
from sklearn.model_selection import train_test_split
from sklearn.linear_model import Lasso,Ridge
from sklearn.ensemble import RandomForestRegressor
from sklearn.compose import ColumnTransformer
from sklearn.metrics import r2_score, mean_squared_error
from sklearn.preprocessing import OneHotEncoder,StandardScaler
from sklearn.compose import make_column_transformer
from sklearn.pipeline import make_pipeline
from sklearn.metrics import r2_score

In [63]:
# Define the preprocessor
column_trans = ColumnTransformer(
    transformers=[
        ('onehotencoder', OneHotEncoder(sparse=False), ['location']),
    ],
    remainder='passthrough'
)

In [61]:
X_train, X_test, y_train ,y_test = train_test_split(X, y , test_size=0.2 , random_state=0)

In [62]:
print(X_train.shape)
print(X_test.shape)

(5883, 4)
(1471, 4)

## Lasso Regression

In [65]:
lasso = Lasso()
scaler = StandardScaler()

pipe = make_pipeline(column_trans,scaler,lasso)
pipe.fit(X_train,y_train)

y_pred_lasso =  pipe.predict(X_test)

C:\Users\amish\anaconda3\lib\site-packages\sklearn\preprocessing\_encoders.py:975: FutureWarning: `sparse` was renamed to `sparse_output` in version 1.2 and will be removed in 1.4. `sparse_output` is ignored unless you leave `sparse` to its default value.
  warnings.warn(

In [66]:
 accuracy_lasso = r2_score(y_test,y_pred_lasso)

print("R-squared (R2) Score for Lasso Regression:", accuracy_lasso)

R-squared (R2) Score for Lasso Regression: 0.8910664972026862

## Rigid Regression

In [71]:
ridge = Ridge()

pipe = make_pipeline(column_trans, scaler, ridge)

pipe.fit(X_train, y_train)

y_pred_ridge = pipe.predict(X_test)

C:\Users\amish\anaconda3\lib\site-packages\sklearn\preprocessing\_encoders.py:975: FutureWarning: `sparse` was renamed to `sparse_output` in version 1.2 and will be removed in 1.4. `sparse_output` is ignored unless you leave `sparse` to its default value.
  warnings.warn(

In [72]:
# Calculate R-squared score for Ridge Regression
accuracy_ridge = r2_score(y_test, y_pred_ridge)

print("R-squared (R2) Score for Ridge Regression:", accuracy_ridge)

R-squared (R2) Score for Ridge Regression: 0.8916843143171588

# importing

In [77]:
import pickle
pickle.dump(pipe,open('rigid.pkl','wb'))

In [79]:
test_pipe = pickle.load(open("rigid.pkl",'rb'))

In [81]:
# Testing using trained ridig model
location = 'Aundh' 
bhk = '2'
bath = 1.0 
sqft = 900.0

input = pd.DataFrame ([[sqft,bath,location,bhk]],columns=['total_sqft','bath','location','bhk'])
# input1
prediction = pipe.predict(input)[0] * 1e5
output = str(np.round(prediction, 2))
output

'4744681.3'